Revit 2027 API
Connector.GetMEPConnectorInfo Method
 Gets MEP connector information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPConnectorInfo GetMEPConnectorInfo()
Public Function GetMEPConnectorInfo As MEPConnectorInfo
public:
MEPConnectorInfo^ GetMEPConnectorInfo()
member GetMEPConnectorInfo : unit -> MEPConnectorInfo
Return Value
MEPConnectorInfo
 Returns null if there is no MEP connector information associated.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace